[
  {
    "text": "Massage with oils",
    "description": "Using massage oils to create a sensual, relaxing experience together. It's about connection, touch, and taking time to explore each other's bodies.",
    "intensity": 0,
    "category": "sensual",
    "labels": ["romantic", "intimate", "sensual", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about giving each other massages?",
      "What kind of touch feels best to you?",
      "Where would you like me to focus the massage?",
      "Tell me what feels good as I touch you."
    ]
  },
  {
    "text": "Trying new positions",
    "description": "Exploring different ways to connect physically that feel comfortable for both of you. It's about finding what works and what feels good together.",
    "intensity": 1,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What positions have you been curious about?",
      "How can we make trying new things feel comfortable?",
      "What feels best for you right now?",
      "Let's explore what works for both of us."
    ]
  },
  {
    "text": "Bratty/Playful resistance",
    "description": "Playful resistance involves saying 'no' when you mean 'yes' in a teasing, consensual way. It's about creating tension and playfulness while maintaining clear boundaries and communication.",
    "intensity": 2,
    "category": "playful",
    "labels": ["playful", "teasing", "consent", "communication"],
    "dirty_talk_templates": [
      "How do you feel about playful resistance?",
      "What if I said 'no' but meant 'yes'?",
      "Tell me about times you've enjoyed being teased.",
      "How could we explore this in a way that feels safe?"
    ]
  },
  {
    "text": "Doctor/Patient roleplay",
    "description": "A playful scenario where one person takes on a medical role in a consensual, fun way. It's about exploring power dynamics and scenarios together with clear boundaries.",
    "intensity": 2,
    "category": "roleplay",
    "labels": ["roleplay", "playful", "communication", "boundaries"],
    "dirty_talk_templates": [
      "What roleplay scenarios interest you?",
      "How could we make roleplay fun and safe?",
      "What kind of characters would you like to explore?",
      "Tell me about your roleplay fantasies."
    ]
  },
  {
    "text": "Using vibrators together",
    "description": "Incorporating toys into your intimate time to enhance pleasure for both partners. It's about exploring new sensations and finding what feels good together.",
    "intensity": 2,
    "category": "toys",
    "labels": ["toys", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "How do you feel about using toys together?",
      "What kind of sensations interest you?",
      "Where would you like to explore with toys?",
      "Let's talk about what toys might be fun to try."
    ]
  },
  {
    "text": "Sensual shower together",
    "description": "Taking time in the shower to connect, wash each other, and enjoy being close. It's about intimacy, touch, and being present together.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "sensual", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about showering together?",
      "What would make shower time more intimate?",
      "Tell me about your favorite way to connect in the shower.",
      "How can we make this feel special?"
    ]
  },
  {
    "text": "Talking about fantasies",
    "description": "Sharing your desires and dreams with each other in a safe, judgment-free space. It's about building trust and understanding what excites you both.",
    "intensity": 1,
    "category": "communication",
    "labels": ["communication", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What fantasies have you been thinking about?",
      "How do you feel about sharing your desires?",
      "What would you like to explore together?",
      "Tell me about something that turns you on."
    ]
  },
  {
    "text": "Teasing and edging",
    "description": "Building arousal slowly through playful teasing and delaying gratification. It's about creating anticipation and intensity while staying connected and communicating.",
    "intensity": 2,
    "category": "playful",
    "labels": ["playful", "teasing", "intimate", "exploration"],
    "dirty_talk_templates": [
      "How do you feel about being teased?",
      "What kind of anticipation excites you?",
      "Tell me about times you've enjoyed edging.",
      "How can we explore this together safely?"
    ]
  },
  {
    "text": "Sensual dancing together",
    "description": "Moving together to music, feeling each other's bodies, and creating an intimate connection through movement. It's about being present and playful together.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "playful", "sensual", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about dancing together?",
      "What kind of music makes you feel sensual?",
      "Tell me about dancing that feels intimate.",
      "How can we make movement feel more connected?"
    ]
  },
  {
    "text": "Light bondage with scarves",
    "description": "Using soft materials like scarves to gently restrain hands or create playful scenarios. It's about exploring power dynamics in a safe, consensual way with soft materials.",
    "intensity": 2,
    "category": "kink",
    "labels": ["kink", "exploration", "consent", "communication"],
    "dirty_talk_templates": [
      "How do you feel about light bondage?",
      "What kind of restraint interests you?",
      "How can we make this feel safe and fun?",
      "Tell me about your boundaries around restraint."
    ]
  },
  {
    "text": "Sensual photography session",
    "description": "Taking intimate photos of each other in a private, consensual setting. It's about celebrating each other's bodies and creating something beautiful together.",
    "intensity": 2,
    "category": "romantic",
    "labels": ["romantic", "intimate", "exploration", "communication"],
    "dirty_talk_templates": [
      "How do you feel about intimate photography?",
      "What would make you feel comfortable being photographed?",
      "How can we make this feel special and safe?",
      "Tell me about what you'd like to capture together."
    ]
  },
  {
    "text": "Trying new locations",
    "description": "Exploring intimacy in different places like the kitchen, living room, or other private spaces in your home. It's about breaking routine and finding excitement in new settings.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "playful", "communication", "boundaries"],
    "dirty_talk_templates": [
      "What locations have you been curious about?",
      "How do you feel about trying different spaces?",
      "Where would feel exciting and safe to explore?",
      "Tell me about places that turn you on."
    ]
  },
  {
    "text": "Sensual feeding each other",
    "description": "Sharing food in an intimate, playful way by feeding each other. It's about connection, care, and adding a sensual element to eating together.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "playful", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about feeding each other?",
      "What foods feel sensual to you?",
      "How can we make eating together more intimate?",
      "Tell me about sharing food in a playful way."
    ]
  },
  {
    "text": "Sensual kissing games",
    "description": "Exploring different ways to kiss, from gentle pecks to passionate embraces. It's about connection, presence, and discovering what feels good together.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of kissing do you love?",
      "How do you like to be kissed?",
      "Tell me about your favorite kissing moments.",
      "What would make kissing feel more intense?"
    ]
  },
  {
    "text": "Sensual bath together",
    "description": "Taking a relaxing bath together, washing each other, and enjoying the warmth and closeness. It's about slowing down and being present with each other.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "sensual", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about bathing together?",
      "What would make bath time more intimate?",
      "Tell me about your ideal relaxing bath together.",
      "How can we make this feel special?"
    ]
  },
  {
    "text": "Sensual touching games",
    "description": "Playing games where you explore each other's bodies through touch, guessing games, or blindfolded exploration. It's about discovery and connection through sensation.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of touching games interest you?",
      "How do you feel about exploring through touch?",
      "Tell me about sensations that feel good to you.",
      "What would make touch feel more exciting?"
    ]
  },
  {
    "text": "Blindfolded exploration",
    "description": "Using a blindfold to heighten other senses and create anticipation. It's about trust, sensation, and discovering new ways to experience each other.",
    "intensity": 2,
    "category": "kink",
    "labels": ["kink", "exploration", "sensual", "communication"],
    "dirty_talk_templates": [
      "How do you feel about being blindfolded?",
      "What sensations interest you when you can't see?",
      "How can we make this feel safe and exciting?",
      "Tell me about your boundaries around sensory play."
    ]
  },
  {
    "text": "Sensual communication exercises",
    "description": "Practicing talking about desires, boundaries, and what feels good in a structured, supportive way. It's about building skills for ongoing intimate communication.",
    "intensity": 1,
    "category": "communication",
    "labels": ["communication", "intimate", "exploration", "beginner-friendly"],
    "dirty_talk_templates": [
      "How comfortable are you talking about desires?",
      "What would help you share more openly?",
      "How can we practice better communication?",
      "Tell me about what feels hard to talk about."
    ]
  },
  {
    "text": "Temperature play with ice",
    "description": "Using ice cubes or warm items to create contrasting sensations on the skin. It's about exploring different feelings and adding variety to touch.",
    "intensity": 2,
    "category": "kink",
    "labels": ["kink", "exploration", "sensual", "communication"],
    "dirty_talk_templates": [
      "How do you feel about temperature play?",
      "What kind of sensations interest you?",
      "How can we make this feel safe and fun?",
      "Tell me about your boundaries around temperature."
    ]
  },
  {
    "text": "Sensual lotion application",
    "description": "Taking time to apply lotion to each other's bodies, focusing on touch, care, and connection. It's about being present and attentive to each other's needs.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about being cared for this way?",
      "What kind of touch feels best to you?",
      "Tell me about times you've felt really taken care of.",
      "How can we make this feel more intimate?"
    ]
  },
  {
    "text": "Sensual reading together",
    "description": "Reading erotic or romantic stories to each other, taking turns and letting words create intimacy. It's about sharing fantasies and creating a shared experience through storytelling.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about reading together?",
      "What kind of stories interest you?",
      "How can we make reading feel more intimate?",
      "Tell me about stories that turn you on."
    ]
  },
  {
    "text": "Orgasm control play",
    "description": "One partner guiding when the other can orgasm, creating anticipation and intensity. It's about trust, communication, and exploring power dynamics consensually.",
    "intensity": 3,
    "category": "kink",
    "labels": ["kink", "exploration", "consent", "communication"],
    "dirty_talk_templates": [
      "How do you feel about orgasm control?",
      "What kind of power dynamics interest you?",
      "How can we make this feel safe and exciting?",
      "Tell me about your boundaries around control."
    ]
  },
  {
    "text": "Sensual cooking together",
    "description": "Preparing food together in an intimate, playful way, feeding each other, and making the kitchen a space for connection. It's about turning everyday activities into opportunities for closeness.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about cooking together?",
      "What would make cooking feel more intimate?",
      "Tell me about playful moments in the kitchen.",
      "How can we make everyday activities more connected?"
    ]
  },
  {
    "text": "Sensory deprivation play",
    "description": "Using blindfolds, earplugs, or other methods to limit senses and heighten others. It's about trust, sensation, and exploring how reducing input can intensify what remains.",
    "intensity": 3,
    "category": "kink",
    "labels": ["kink", "exploration", "consent", "communication"],
    "dirty_talk_templates": [
      "How do you feel about sensory deprivation?",
      "What sensations interest you when senses are limited?",
      "How can we make this feel safe and intense?",
      "Tell me about your boundaries around sensory play."
    ]
  },
  {
    "text": "Sensual stretching together",
    "description": "Doing gentle stretches together, helping each other into positions, and using movement to connect. It's about care, touch, and being present with each other's bodies.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "intimate", "exploration", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about stretching together?",
      "What kind of movement feels good to you?",
      "Tell me about times movement has felt intimate.",
      "How can we make physical activity more connected?"
    ]
  },
  {
    "text": "Rope play basics",
    "description": "Learning basic rope techniques together for decorative or light restraint purposes. It's about skill-building, trust, and exploring aesthetics and sensation safely.",
    "intensity": 3,
    "category": "kink",
    "labels": ["kink", "exploration", "consent", "communication"],
    "dirty_talk_templates": [
      "How do you feel about rope play?",
      "What kind of rope work interests you?",
      "How can we learn this safely together?",
      "Tell me about your boundaries around rope."
    ]
  },
  {
    "text": "Sensual pillow talk",
    "description": "Lying together and talking about desires, feelings, and intimate thoughts. It's about vulnerability, connection, and creating space for deep conversation.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What do you want to talk about right now?",
      "How do you feel about sharing your thoughts?",
      "Tell me about something you've been thinking about.",
      "What would make you feel more comfortable opening up?"
    ]
  },
  {
    "text": "Wax play with candles",
    "description": "Using special candles designed for body use to create warm, dripping sensations. It's about exploring temperature and texture while being careful about safety and communication.",
    "intensity": 3,
    "category": "kink",
    "labels": ["kink", "exploration", "consent", "boundaries"],
    "dirty_talk_templates": [
      "How do you feel about wax play?",
      "What kind of temperature sensations interest you?",
      "How can we do this safely together?",
      "Tell me about your boundaries around wax."
    ]
  },
  {
    "text": "Sensual morning routines",
    "description": "Starting the day together with intimate touch, cuddling, or slow morning connection. It's about beginning your day with presence and closeness.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you like to start your mornings?",
      "What would make mornings feel more connected?",
      "Tell me about your ideal morning together.",
      "How can we make waking up together special?"
    ]
  },
  {
    "text": "Pet play roleplay",
    "description": "Exploring playful scenarios where one person takes on animal-like characteristics in a consensual, fun way. It's about playfulness, power dynamics, and creating scenarios together.",
    "intensity": 3,
    "category": "kink",
    "labels": ["kink", "roleplay", "exploration", "communication"],
    "dirty_talk_templates": [
      "How do you feel about pet play?",
      "What kind of roleplay scenarios interest you?",
      "How can we make this feel fun and safe?",
      "Tell me about your boundaries around roleplay."
    ]
  },
  {
    "text": "Sensual back rubs",
    "description": "Giving each other back massages, focusing on relaxation, touch, and care. It's about taking time to help each other feel good and connected.",
    "intensity": 0,
    "category": "sensual",
    "labels": ["sensual", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you like to be touched?",
      "What kind of pressure feels best?",
      "Tell me about times you've felt really relaxed.",
      "Where do you hold tension that needs attention?"
    ]
  },
  {
    "text": "Sensual date nights",
    "description": "Planning special evenings focused on connection, whether at home or out, with attention to creating intimate moments. It's about prioritizing time together and making it special.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What would make a perfect date night for you?",
      "How do you like to feel on dates?",
      "Tell me about your ideal evening together.",
      "What would make you feel most connected?"
    ]
  },
  {
    "text": "Sensual foot massages",
    "description": "Taking time to massage each other's feet, focusing on care, touch, and relaxation. It's about showing care through attention to often-neglected areas.",
    "intensity": 0,
    "category": "sensual",
    "labels": ["sensual", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about foot massages?",
      "What kind of touch feels best on your feet?",
      "Tell me about times you've felt really cared for.",
      "How can we make this feel more intimate?"
    ]
  },
  {
    "text": "Sensation play exploration",
    "description": "Exploring different textures, pressures, and types of touch to discover what feels good. It's about variety, discovery, and communicating about sensations together.",
    "intensity": 2,
    "category": "kink",
    "labels": ["kink", "exploration", "sensual", "communication"],
    "dirty_talk_templates": [
      "What kind of sensations interest you?",
      "How do different textures feel to you?",
      "Tell me about touches that have surprised you.",
      "What would you like to explore together?"
    ]
  },
  {
    "text": "Sensual eye contact",
    "description": "Holding prolonged eye contact during intimate moments to deepen connection and presence. It's about vulnerability, intimacy, and being fully present with each other.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about prolonged eye contact?",
      "What does it feel like when we really look at each other?",
      "Tell me about times eye contact has felt intense.",
      "How can we use eye contact to feel more connected?"
    ]
  },
  {
    "text": "Sensual slow dancing",
    "description": "Moving together slowly to music, feeling each other's bodies, and creating an intimate, romantic moment. It's about presence, connection, and letting movement express what words can't.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "playful", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of music makes you want to move?",
      "How do you feel when we dance together?",
      "Tell me about dancing that feels intimate.",
      "What would make slow dancing feel more special?"
    ]
  },
  {
    "text": "Orgasm denial play",
    "description": "Delaying orgasm to build intensity and anticipation, with clear communication and consent. It's about exploring control, trust, and heightened sensation through waiting.",
    "intensity": 3,
    "category": "kink",
    "labels": ["kink", "exploration", "consent", "communication"],
    "dirty_talk_templates": [
      "How do you feel about orgasm denial?",
      "What kind of anticipation interests you?",
      "How can we make this feel safe and intense?",
      "Tell me about your boundaries around control."
    ]
  },
  {
    "text": "Sensual hair brushing",
    "description": "Taking time to brush each other's hair, focusing on care, touch, and creating a relaxing, intimate moment. It's about showing attention and care through gentle actions.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "sensual", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about having your hair brushed?",
      "What kind of touch feels best on your scalp?",
      "Tell me about times you've felt really cared for.",
      "How can we make grooming feel more intimate?"
    ]
  },
  {
    "text": "Sensual cuddling sessions",
    "description": "Taking extended time to hold each other, be close, and enjoy physical connection without expectation. It's about presence, comfort, and being together.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you like to cuddle?",
      "What positions feel most comfortable?",
      "Tell me about times cuddling has felt really good.",
      "How can we make cuddling feel more connected?"
    ]
  },
  {
    "text": "Multiple orgasms exploration",
    "description": "Exploring the possibility of experiencing multiple orgasms together, focusing on communication and what feels good. It's about discovery, patience, and being present with sensation.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about exploring multiple orgasms?",
      "What would make this feel comfortable?",
      "Tell me about your experiences with intensity.",
      "How can we explore this together?"
    ]
  },
  {
    "text": "Sensual hand holding",
    "description": "Taking time to hold hands, feel each other's presence, and connect through simple touch. It's about being present and showing care through small gestures.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel when we hold hands?",
      "What does touch mean to you?",
      "Tell me about times simple touch has felt powerful.",
      "How can we be more present with each other?"
    ]
  },
  {
    "text": "Sensual compliments",
    "description": "Taking time to tell each other what you find attractive, both physically and emotionally. It's about appreciation, vulnerability, and building each other up.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What do you find most attractive about me?",
      "How do you like to receive compliments?",
      "Tell me about times you've felt really appreciated.",
      "What would make you feel more seen?"
    ]
  },
  {
    "text": "Orgasm synchronization",
    "description": "Working together to experience orgasm at the same time, focusing on communication and presence. It's about connection, timing, and being attuned to each other.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about trying to sync orgasms?",
      "What would help us be more in tune?",
      "Tell me about times you've felt really connected.",
      "How can we practice being more present together?"
    ]
  },
  {
    "text": "Sensual scent exploration",
    "description": "Taking time to notice and appreciate each other's natural scents, or using perfumes and colognes intentionally. It's about engaging the sense of smell to deepen connection.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "intimate", "exploration", "beginner-friendly"],
    "dirty_talk_templates": [
      "What scents do you find attractive?",
      "How does scent affect your arousal?",
      "Tell me about scents that turn you on.",
      "How can we use scent to feel more connected?"
    ]
  },
  {
    "text": "Sensual gratitude practice",
    "description": "Sharing what you're grateful for about each other, your relationship, and your intimate connection. It's about appreciation, vulnerability, and building positive connection.",
    "intensity": 0,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What are you grateful for about us?",
      "How do you like to express appreciation?",
      "Tell me about times you've felt really grateful.",
      "What would make you feel more appreciated?"
    ]
  },
  {
    "text": "Sensual texture exploration",
    "description": "Exploring different textures together—silk, fur, rough materials—to discover what feels good on the skin. It's about variety, sensation, and communicating about what you discover.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What textures feel good to you?",
      "How do different materials feel on your skin?",
      "Tell me about textures that surprise you.",
      "What would you like to explore together?"
    ]
  },
  {
    "text": "Sensual breathing exercises",
    "description": "Practicing synchronized breathing together to create connection and presence. It's about being in sync, calming the nervous system, and feeling connected through breath.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about breathing together?",
      "What does synchronized breathing feel like?",
      "Tell me about times breath has felt intimate.",
      "How can we use breathing to feel more connected?"
    ]
  },
  {
    "text": "Orgasm counting games",
    "description": "Playing playful games around counting or tracking orgasms together. It's about fun, communication, and adding a playful element to intimate time.",
    "intensity": 2,
    "category": "playful",
    "labels": ["playful", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "How do you feel about playful games?",
      "What kind of games interest you?",
      "Tell me about times playfulness has felt good.",
      "How can we make intimacy more fun?"
    ]
  },
  {
    "text": "Sensual voice exploration",
    "description": "Using your voice to create intimacy—whispering, moaning, talking dirty, or making sounds together. It's about expressing yourself and responding to each other through sound.",
    "intensity": 1,
    "category": "communication",
    "labels": ["communication", "intimate", "exploration", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about using your voice?",
      "What sounds turn you on?",
      "Tell me about times voice has felt intimate.",
      "How can we explore sound together?"
    ]
  },
  {
    "text": "Sensual appreciation rituals",
    "description": "Creating regular practices of appreciating each other's bodies, minds, and presence. It's about building ongoing appreciation and making it a habit to see each other.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What do you appreciate most about me?",
      "How do you like to be appreciated?",
      "Tell me about times you've felt really seen.",
      "How can we make appreciation a regular practice?"
    ]
  },
  {
    "text": "Orgasm challenges together",
    "description": "Setting playful goals or challenges around orgasms together, like trying new techniques or exploring intensity. It's about fun, communication, and shared exploration.",
    "intensity": 2,
    "category": "playful",
    "labels": ["playful", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "What kind of challenges interest you?",
      "How do you feel about playful goals?",
      "Tell me about times challenges have been fun.",
      "How can we make exploration more playful?"
    ]
  },
  {
    "text": "Temperature contrast play",
    "description": "Alternating between warm and cool sensations to create variety and intensity. It's about exploring how temperature affects sensation and arousal.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about temperature play?",
      "What kind of contrasts interest you?",
      "Tell me about times temperature has felt intense.",
      "How can we explore this safely together?"
    ]
  },
  {
    "text": "Sensual letter writing",
    "description": "Writing each other intimate letters about desires, feelings, and what you love about each other. It's about vulnerability, thoughtfulness, and creating something lasting.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What would you write in a letter to me?",
      "How do you feel about expressing yourself in writing?",
      "Tell me about times writing has felt intimate.",
      "What would you want me to know?"
    ]
  },
  {
    "text": "Orgasm games together",
    "description": "Creating playful games around orgasms, like timing, techniques, or exploring different types. It's about fun, communication, and making intimacy playful.",
    "intensity": 2,
    "category": "playful",
    "labels": ["playful", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "What kind of games interest you?",
      "How do you feel about playful exploration?",
      "Tell me about times games have been fun.",
      "How can we make this more playful?"
    ]
  },
  {
    "text": "Sensual pressure points",
    "description": "Learning and exploring pressure points on each other's bodies for pleasure and relaxation. It's about discovery, communication, and finding what feels good.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What pressure points interest you?",
      "How do you like to be touched?",
      "Tell me about spots that feel really good.",
      "How can we explore pressure together?"
    ]
  },
  {
    "text": "Sensual memory sharing",
    "description": "Sharing favorite memories of intimate moments together, building connection through shared history. It's about appreciation, nostalgia, and strengthening your bond.",
    "intensity": 0,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What's your favorite memory of us?",
      "How do you like to remember our time together?",
      "Tell me about a moment that stands out.",
      "What memories make you feel most connected?"
    ]
  },
  {
    "text": "Orgasm timing exploration",
    "description": "Experimenting with when and how orgasms happen, exploring different rhythms and approaches. It's about discovery, communication, and finding what works for both of you.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What timing feels best to you?",
      "How do you like to build toward orgasm?",
      "Tell me about times timing has felt perfect.",
      "How can we explore rhythm together?"
    ]
  },
  {
    "text": "Vibration exploration with toys",
    "description": "Using vibrators and other vibrating toys to explore different sensations and intensities together. It's about discovery, communication, and finding what feels good.",
    "intensity": 1,
    "category": "toys",
    "labels": ["toys", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about vibrators?",
      "What kind of vibrations interest you?",
      "Tell me about sensations that feel good.",
      "How can we explore toys together?"
    ]
  },
  {
    "text": "Sensual dream sharing",
    "description": "Talking about your dreams, both sleeping dreams and waking fantasies, to understand each other better. It's about vulnerability, connection, and sharing inner worlds.",
    "intensity": 0,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What dreams have you been having?",
      "How do you feel about sharing dreams?",
      "Tell me about a dream that stands out.",
      "What would you like to dream about together?"
    ]
  },
  {
    "text": "Orgasm intensity exploration",
    "description": "Exploring different ways to experience more intense orgasms together through technique, timing, and communication. It's about discovery and finding what creates the most pleasure.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What creates the most intensity for you?",
      "How do you like to build toward orgasm?",
      "Tell me about your most intense experiences.",
      "How can we explore intensity together?"
    ]
  },
  {
    "text": "Sensual rhythm exploration",
    "description": "Experimenting with different rhythms, speeds, and patterns of movement together. It's about variety, communication, and finding what feels good in the moment.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What rhythms feel best to you?",
      "How do you like to move together?",
      "Tell me about times rhythm has felt perfect.",
      "How can we explore movement together?"
    ]
  },
  {
    "text": "Sensual future planning",
    "description": "Talking about future intimate experiences you'd like to have together, building anticipation and connection. It's about dreaming together and creating shared goals.",
    "intensity": 0,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What would you like to explore in the future?",
      "How do you feel about planning together?",
      "Tell me about something you're curious about.",
      "What would make you excited about our future?"
    ]
  },
  {
    "text": "Orgasm variety exploration",
    "description": "Exploring different types of orgasms, techniques, and approaches to create variety and discovery. It's about communication, experimentation, and finding new ways to experience pleasure.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What types of orgasms interest you?",
      "How do you like to experience pleasure?",
      "Tell me about different ways you've orgasmed.",
      "How can we explore variety together?"
    ]
  },
  {
    "text": "Sensual movement together",
    "description": "Moving your bodies together in sync, whether dancing, stretching, or just being in motion. It's about connection, presence, and feeling each other's bodies move.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel when we move together?",
      "What kind of movement feels good?",
      "Tell me about times movement has felt intimate.",
      "How can we be more in sync?"
    ]
  },
  {
    "text": "Sensual presence practice",
    "description": "Practicing being fully present with each other during intimate moments, without distraction. It's about mindfulness, connection, and being here now together.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How present do you feel right now?",
      "What helps you be more present?",
      "Tell me about times you've felt really here.",
      "How can we practice presence together?"
    ]
  },
  {
    "text": "Orgasm focus exercises",
    "description": "Practicing focusing attention on orgasm, building intensity through mindfulness and presence. It's about deepening experience and exploring how attention affects sensation.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you focus during orgasm?",
      "What helps you build intensity?",
      "Tell me about times focus has deepened experience.",
      "How can we practice focus together?"
    ]
  },
  {
    "text": "Sensual connection exercises",
    "description": "Practicing exercises designed to build emotional and physical connection together. It's about intentional intimacy, communication, and strengthening your bond.",
    "intensity": 0,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How connected do you feel right now?",
      "What helps you feel more connected?",
      "Tell me about times you've felt really connected.",
      "How can we build more connection?"
    ]
  },
  {
    "text": "Teacher/Student roleplay",
    "description": "Exploring playful scenarios where one person takes on a teaching role in a consensual, fun way. It's about power dynamics, playfulness, and creating scenarios together.",
    "intensity": 2,
    "category": "roleplay",
    "labels": ["roleplay", "playful", "communication", "boundaries"],
    "dirty_talk_templates": [
      "What roleplay scenarios interest you?",
      "How could we make roleplay fun and safe?",
      "What kind of characters would you like to explore?",
      "Tell me about your roleplay fantasies."
    ]
  },
  {
    "text": "Boss/Employee roleplay",
    "description": "Playing with workplace power dynamics in a consensual, fun scenario. It's about exploring control, submission, and creating playful situations together.",
    "intensity": 2,
    "category": "roleplay",
    "labels": ["roleplay", "playful", "communication", "boundaries"],
    "dirty_talk_templates": [
      "What roleplay scenarios turn you on?",
      "How could we make this feel safe and fun?",
      "What kind of power dynamics interest you?",
      "Tell me about your roleplay desires."
    ]
  },
  {
    "text": "Stranger/Stranger roleplay",
    "description": "Pretending to meet for the first time and exploring the excitement of new connection. It's about playfulness, anticipation, and creating scenarios together.",
    "intensity": 2,
    "category": "roleplay",
    "labels": ["roleplay", "playful", "exploration", "communication"],
    "dirty_talk_templates": [
      "What would it be like to meet for the first time?",
      "How could we make this feel exciting?",
      "What kind of scenarios interest you?",
      "Tell me about your roleplay fantasies."
    ]
  },
  {
    "text": "Using cock rings together",
    "description": "Exploring cock rings to enhance sensation and potentially prolong intimacy. It's about discovery, communication, and finding what feels good for both partners.",
    "intensity": 2,
    "category": "toys",
    "labels": ["toys", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "How do you feel about trying cock rings?",
      "What kind of sensations interest you?",
      "How can we explore this together?",
      "Tell me about your boundaries around toys."
    ]
  },
  {
    "text": "Using butt plugs together",
    "description": "Exploring anal play with plugs designed for safety and pleasure. It's about discovery, communication, and finding what feels good while being careful about safety.",
    "intensity": 3,
    "category": "toys",
    "labels": ["toys", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "How do you feel about anal play?",
      "What would make this feel comfortable?",
      "How can we explore this safely together?",
      "Tell me about your boundaries around anal play."
    ]
  },
  {
    "text": "Using clitoral stimulators",
    "description": "Exploring toys designed specifically for clitoral stimulation to enhance pleasure. It's about discovery, communication, and finding what creates the most sensation.",
    "intensity": 2,
    "category": "toys",
    "labels": ["toys", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "How do you feel about clitoral stimulation?",
      "What kind of sensations interest you?",
      "How can we explore this together?",
      "Tell me about what feels best to you."
    ]
  },
  {
    "text": "Using couples' vibrators",
    "description": "Exploring toys designed for both partners to enjoy simultaneously. It's about shared pleasure, communication, and finding toys that work for both of you.",
    "intensity": 2,
    "category": "toys",
    "labels": ["toys", "exploration", "intimate", "communication"],
    "dirty_talk_templates": [
      "How do you feel about couples' toys?",
      "What kind of shared sensations interest you?",
      "How can we explore this together?",
      "Tell me about toys that might work for both of us."
    ]
  },
  {
    "text": "Using remote control toys",
    "description": "Exploring toys that can be controlled remotely for playful power dynamics and surprise. It's about fun, communication, and creating anticipation together.",
    "intensity": 2,
    "category": "toys",
    "labels": ["toys", "playful", "exploration", "communication"],
    "dirty_talk_templates": [
      "How do you feel about remote control toys?",
      "What kind of playfulness interests you?",
      "How can we make this fun and safe?",
      "Tell me about your boundaries around control."
    ]
  },
  {
    "text": "Mirror play exploration",
    "description": "Using mirrors to watch yourselves together, adding visual stimulation and self-awareness. It's about exploration, communication, and seeing each other from new angles.",
    "intensity": 2,
    "category": "romantic",
    "labels": ["romantic", "intimate", "exploration", "communication"],
    "dirty_talk_templates": [
      "How do you feel about watching ourselves?",
      "What would make this feel comfortable?",
      "Tell me about times visual stimulation has been exciting.",
      "How can we explore this together?"
    ]
  },
  {
    "text": "Sensual music creation",
    "description": "Creating playlists together or making music that enhances your intimate connection. It's about shared creativity, communication, and using sound to deepen intimacy.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What music makes you feel sensual?",
      "How can we create playlists together?",
      "Tell me about music that turns you on.",
      "How can we use sound to feel more connected?"
    ]
  },
  {
    "text": "Sensual stargazing together",
    "description": "Lying outside together under the stars, talking, and being present with each other. It's about romance, connection, and creating special moments in nature.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about being outside together?",
      "What would make stargazing feel more intimate?",
      "Tell me about times nature has felt romantic.",
      "How can we create special moments outside?"
    ]
  },
  {
    "text": "Sensual cooking naked",
    "description": "Cooking together while naked or partially clothed, adding a playful, intimate element to a daily activity. It's about fun, connection, and making ordinary moments special.",
    "intensity": 1,
    "category": "playful",
    "labels": ["playful", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about cooking together like this?",
      "What would make this feel fun and safe?",
      "Tell me about times playfulness has felt good.",
      "How can we make everyday activities more intimate?"
    ]
  },
  {
    "text": "Sensual yoga together",
    "description": "Practicing yoga together, helping each other into positions, and using movement to connect. It's about care, touch, and being present with each other's bodies.",
    "intensity": 1,
    "category": "sensual",
    "labels": ["sensual", "intimate", "exploration", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about doing yoga together?",
      "What kind of movement feels good?",
      "Tell me about times movement has felt intimate.",
      "How can we make physical activity more connected?"
    ]
  },
  {
    "text": "Sensual meditation together",
    "description": "Meditating together, either separately in the same space or as a shared practice. It's about presence, connection, and creating calm, intimate moments.",
    "intensity": 0,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about meditating together?",
      "What would make this feel more connected?",
      "Tell me about times presence has felt intimate.",
      "How can we practice being present together?"
    ]
  },
  {
    "text": "Sensual journaling together",
    "description": "Writing in journals together, sharing thoughts, desires, and reflections. It's about vulnerability, communication, and creating space for self-expression.",
    "intensity": 0,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about journaling together?",
      "What would you want to write about?",
      "Tell me about times writing has felt intimate.",
      "How can we create space for reflection?"
    ]
  },
  {
    "text": "Sensual art creation",
    "description": "Creating art together, whether drawing, painting, or other creative activities, as a form of connection. It's about shared creativity, presence, and expressing yourselves together.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about creating art together?",
      "What kind of creativity interests you?",
      "Tell me about times creativity has felt connected.",
      "How can we express ourselves together?"
    ]
  },
  {
    "text": "Sensual video watching",
    "description": "Watching erotic or romantic content together and discussing what you find arousing. It's about exploration, communication, and learning about each other's desires.",
    "intensity": 2,
    "category": "exploration",
    "labels": ["exploration", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about watching content together?",
      "What kind of content interests you?",
      "Tell me about what turns you on.",
      "How can we explore this together safely?"
    ]
  },
  {
    "text": "Sensual podcast listening",
    "description": "Listening to podcasts about intimacy, relationships, or sexuality together and discussing them. It's about learning, communication, and growing together.",
    "intensity": 1,
    "category": "communication",
    "labels": ["communication", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What topics interest you?",
      "How do you feel about learning together?",
      "Tell me about things you'd like to explore.",
      "How can we grow together?"
    ]
  },
  {
    "text": "Sensual book reading",
    "description": "Reading books about intimacy, relationships, or erotica together and discussing them. It's about learning, connection, and exploring ideas together.",
    "intensity": 1,
    "category": "communication",
    "labels": ["communication", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of books interest you?",
      "How do you feel about reading together?",
      "Tell me about topics you'd like to explore.",
      "How can we learn together?"
    ]
  },
  {
    "text": "Sensual game playing",
    "description": "Playing games designed for couples to explore intimacy, communication, and connection. It's about fun, discovery, and making exploration playful.",
    "intensity": 1,
    "category": "playful",
    "labels": ["playful", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of games interest you?",
      "How do you feel about playful exploration?",
      "Tell me about games that sound fun.",
      "How can we make discovery more playful?"
    ]
  },
  {
    "text": "Sensual question cards",
    "description": "Using question cards designed for couples to explore desires, fantasies, and connection. It's about structured communication, discovery, and learning about each other.",
    "intensity": 1,
    "category": "communication",
    "labels": ["communication", "exploration", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What questions interest you?",
      "How do you feel about structured conversation?",
      "Tell me about things you'd like to explore.",
      "How can we learn more about each other?"
    ]
  },
  {
    "text": "Sensual truth or dare",
    "description": "Playing truth or dare with an intimate, couples-focused twist. It's about fun, vulnerability, and creating playful opportunities for connection.",
    "intensity": 1,
    "category": "playful",
    "labels": ["playful", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about truth or dare?",
      "What would make this feel fun and safe?",
      "Tell me about times playfulness has been exciting.",
      "How can we make this more intimate?"
    ]
  },
  {
    "text": "Sensual scavenger hunt",
    "description": "Creating a scavenger hunt for each other with intimate clues and rewards. It's about playfulness, anticipation, and making connection fun and creative.",
    "intensity": 1,
    "category": "playful",
    "labels": ["playful", "romantic", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about scavenger hunts?",
      "What kind of clues would be fun?",
      "Tell me about times anticipation has been exciting.",
      "How can we make this playful and special?"
    ]
  },
  {
    "text": "Sensual surprise planning",
    "description": "Planning surprises for each other, whether gifts, experiences, or intimate moments. It's about thoughtfulness, anticipation, and showing care through planning.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of surprises do you like?",
      "How do you feel about being surprised?",
      "Tell me about times surprises have felt special.",
      "How can we plan something meaningful together?"
    ]
  },
  {
    "text": "Sensual gift giving",
    "description": "Giving each other intimate gifts, whether toys, lingerie, or experiences, as a way to show care and explore together. It's about thoughtfulness, communication, and shared exploration.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of gifts would you like?",
      "How do you feel about receiving intimate gifts?",
      "Tell me about gifts that would feel special.",
      "How can we explore this together?"
    ]
  },
  {
    "text": "Sensual lingerie shopping",
    "description": "Shopping for lingerie together, either in person or online, and discussing what you find attractive. It's about communication, exploration, and making each other feel desired.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "communication", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "What kind of lingerie interests you?",
      "How do you feel about shopping together?",
      "Tell me about what you find attractive.",
      "How can we make this feel fun and connected?"
    ]
  },
  {
    "text": "Sensual toy shopping",
    "description": "Shopping for toys together, either in person or online, and discussing what you'd like to explore. It's about communication, discovery, and making decisions together.",
    "intensity": 2,
    "category": "toys",
    "labels": ["toys", "communication", "exploration", "intimate"],
    "dirty_talk_templates": [
      "What kind of toys interest you?",
      "How do you feel about shopping together?",
      "Tell me about what you'd like to explore.",
      "How can we make decisions together?"
    ]
  },
  {
    "text": "Sensual bath bomb creation",
    "description": "Making bath bombs together and then using them in a sensual bath experience. It's about creativity, anticipation, and turning preparation into part of the intimate experience.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about making things together?",
      "What would make this feel special?",
      "Tell me about times creativity has felt connected.",
      "How can we make preparation part of the experience?"
    ]
  },
  {
    "text": "Sensual candle making",
    "description": "Making candles together and then using them to create intimate, romantic atmospheres. It's about creativity, anticipation, and making something special together.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "playful", "intimate", "beginner-friendly"],
    "dirty_talk_templates": [
      "How do you feel about creating together?",
      "What scents would you like?",
      "Tell me about times making things has felt intimate.",
      "How can we make this feel special?"
    ]
  },
  {
    "text": "Sensual playlist creation",
    "description": "Creating playlists together for different moods and intimate moments. It's about shared taste, communication, and using music to enhance connection.",
    "intensity": 1,
    "category": "romantic",
    "labels": ["romantic", "intimate", "communication", "beginner-friendly"],
    "dirty_talk_templates": [
      "What music makes you feel sensual?",
      "How can we create playlists together?",
      "Tell me about songs that turn you on.",
      "How can we use music to feel more connected?"
    ]
  }
]

